{"jobpost":"AMERIA Investment Consulting Company\r\nJOB TITLE:  Chief Financial Officer\r\nPOSITION LOCATION: Yerevan, Armenia\r\nJOB DESCRIPTION:   AMERIA Investment Consulting Company is seeking a\r\nChief Financial Officer. This position manages the company's fiscal and\r\nadministrative functions, provides highly responsible and technically\r\ncomplex staff assistance to the Executive Director. The work performed\r\nrequires a high level of technical proficiency in financial management\r\nand investment management, as well as management, supervisory, and\r\nadministrative skills.\r\nJOB RESPONSIBILITIES:  \r\n- Supervises financial management and administrative staff, including\r\nassigning responsibilities, reviewing employees' work processes and\r\nproducts, counseling employees, giving performance evaluations, and\r\nrecommending disciplinary action;\r\n- Serves as member of management team participating in both strategic\r\nand operational planning for the company;\r\n- Directs and oversees the company's financial management activities,\r\nincluding establishing and monitoring internal controls, managing cash\r\nand investments, and managing the investment portfolio in collaboration\r\nwith the Investment team leader. This includes, but is not limited to,\r\nevaluation of investment risk, concentration risk, fund deployment\r\nlevels, adequacy of loss and liquidity reserves Assists investment team\r\nin development of proper documentation and internal systems;\r\n- Directs and oversees the annual budgeting process, including\r\ndeveloping projections for financial planning, and preparing budgets;\r\n- Prepares external and internal financial management reports, such as\r\naudited financial statements, tax returns, and reports for the board of\r\ndirectors and company staff;\r\n- Develops, implements, and maintains efficient and effective accounting\r\nsystems and controls to ensure compliance with national and\r\ninternational accounting standards and principles, sufficiency of fund\r\naccounting, and comprehensiveness of data for reporting and compliance\r\nrequirements;\r\n- Ensures contract compliance, including interpreting and monitoring\r\ncontracts with clients, submitting required reports, and monitoring\r\ncovenants and other contract terms;\r\n- Oversees the design, implementation and maintenance of computer-based\r\ninformation system. Oversees records retention (both manual and\r\ncomputer-based) and file maintenance activities;\r\n- Serves as company's risk manager, including evaluating loss exposure\r\nand obtaining insurance as appropriate;\r\n- Manages other administrative operations, such as facilities\r\nmanagement, payroll administration, office operations, and\r\nadministrative support;\r\n- Monitors corporate compliance with by-laws and articles of\r\nincorporation regarding corporate registration and reporting of\r\nfundraising operations.\r\nREQUIRED QUALIFICATIONS:  To perform this job successfully, an\r\nindividual must be able to perform each essential duty satisfactorily.\r\nThe requirements listed below are representative of the knowledge,\r\nskill, and\/or ability required.\r\nKnowledge of:\r\n- Generally accepted accounting principles;\r\n- Local accounting standards and legislation;\r\n- State reporting requirements pertaining to accounting;\r\n- Principles and practices of financial management and budgeting;\r\n- Principles and practices of financial systems design and analysis;\r\n- Principles and practices of contract management, records management,\r\nand risk management;\r\n- Principles and practices of management and supervision;\r\n- Principles and practices of information systems management.\r\nAbility to:\r\n- Apply sound fiscal and administrative practices to the company's\r\nactivities;\r\n- Plan, organize and supervise the work of subordinate employees,\r\nincluding training them, assigning and evaluating their work, and\r\nproviding job performance feedback;\r\n- Critically analyze fiscal and administrative policies, practices,\r\nprocedures, and systems, and recommend and implement changes as needed;\r\n- Gather and synthesize financial information from a variety of sources\r\nand present it to a variety of audiences with differing financial\r\nmanagement and analysis expertise;\r\n- Prepare detailed, comprehensive financial reports, including\r\nexplanatory text;\r\n- Operate IBM-compatible personal computer, including word processing,\r\nspreadsheet, and database software applications;\r\n- Operate specialized software applications that support the financial\r\nmanagement and budgeting functions.\r\nQualifications:\r\n- A minimum of 5-7 years Accounting\/ Corporate Finance\/ Banking\r\nexperience, including a role as a CFO;\r\n- Excellent finance and accounting technical skills coupled with a\r\ndemonstrated knowledge of all key financial functions in an consulting\r\ncompany context - accounting, finance, control, treasury, reserving, and\r\nreporting;\r\n- Strong financial planning and analytical skills and experience and the\r\nability to work closely with and support the CEO and other executives in\r\nstrategic development and implementation;\r\n- Excellent leadership, management and supervisory track record of\r\nattracting, selecting, developing, rewarding and retaining high-caliber,\r\naccounting and finance executive and teams who achieve business goals;\r\n- An undergraduate degree in finance, business, or other related\r\ndiscipline is required. A CPA, CFA, ACCA or other financial\r\ncertification is highly preferred, as is a Masters degree in Business\r\nAdministration, Accounting or Finance;\r\n- Fluency in English, Armenian and Russian with outstanding writing\r\nskills;\r\n- Excellent analytical, communication, teamwork, interpersonal skills;\r\n- Need to be well organized and detail-oriented as well as goal\/ result\r\ndriven and able to deal with complex issues.\r\nAPPLICATION PROCEDURES:  To apply for this position, please submit a\r\ncover letter and a resume addressing relevant qualifications and\r\nexperience and information on professional reference strictly to Tatevik\r\nHovhannisyan; Executive Assistant: fax: 374-1-546800 or e-mail:ameria@.... Tel: 374 (1) 524040; 524140. Only shortlisted\r\ncandidates will be notified for an interview.\r\nPlease clearly mention in your application letter that you learned of\r\nthis job opportunity through Career Center and mention the URL of its\r\nwebsite - www.careercenter.am, Thanks.\r\nAPPLICATION DEADLINE:   26 January 2004\r\n----------------------------------\r\nTo place a free posting for job or other career related opportunities in\r\nyour organization at careercenter.am website, e-mail us atmailbox@...","Title":"Chief Financial Officer","status":"published","Year":2004}
{"jobpost":"International Research & Exchanges Board (IREX)\r\nTITLE:   Full-time Community Connections Intern (paid internship)\r\nDURATION:  3 months\r\nLOCATION:  IREX Armenia Main Office; Yerevan, Armenia \r\nDESCRIPTION:   IREX currently seeks to fill the position of a paid\r\nIntern for the Community Connections (CC) Program. The position is based\r\nin the Yerevan office however applicants must be willing to travel\r\nthroughout Armenia as necessary.  This position reports directly to the\r\nCC Program Manager.\r\nRESPONSIBILITIES:  \r\n- Presenting the CC program to interested parties; \r\n- Assisting in planning and scheduling of programmatic meetings and\r\nevents (this includes coordinating logistics for CC staff, visitors and\r\nparticipants);\r\n- Assisting the Program Staff;\r\n- Translation\/Interpretation from Armenian to English and vice versa;\r\n- Helping create, maintain and update the CC filing system and\r\ndatabases;\r\n- Completing general administrative tasks for the CC program within the\r\noffice;\r\n- Other duties as assigned\/ needed.\r\nREQUIRED QUALIFICATIONS:  \r\n- Bachelor's Degree; Master's is preferred;\r\n- Excellent skills in spoken and written English and Armenian languages;\r\n- Past English to Armenian translation and Armenian to English\r\ntranslation experience;\r\n- Good communication and public speaking skills;\r\n- Ability to work independently and as part of a team.\r\nREMUNERATION:  Commensurate with experience.\r\nAPPLICATION PROCEDURES:   Please submit a cover letter and resume to:\r\nIREX Yerevan office, Attn: Community Connections Program; 50 Khanjian\r\nStr, Tekeyan Center, 2nd floor, Yerevan 375010, Armenia. E-mail:cc@.... \r\nPlease clearly mention in your application letter that you learned of\r\nthis opportunity through Career Center and mention the URL of its\r\nwebsite - www.careercenter.am, Thanks.\r\nAPPLICATION DEADLINE:   12 January 2004\r\nABOUT COMPANY:   The International Research & Exchanges Board (IREX) is\r\na US-Based private, non-profit organization. The IREX Armenia Yerevan\r\noffice was established in 1992 and is a place in Armenia where\r\ninterested individuals can obtain up-to-date information on study,\r\nresearch, and professional internship opportunities in the Unites\r\nStates.\r\nIREX Yerevan collaborates with national government branches, local and\r\ninternational NGOs and institutions of higher education in the promotion\r\nof IREX- administered research and professional programs. The goal of\r\nthese programs is to make American academic and professional experiences\r\navailable to qualified individuals.\r\n----------------------------------\r\nTo place a free posting for job or other career related opportunities in\r\nyour organization at careercenter.am website, e-mail us atmailbox@...","Title":"Full-time Community Connections Intern (paid internship)","status":"published","Year":2004}
{"jobpost":"Caucasus Environmental NGO Network (CENN)\r\nJOB TITLE:  Country Coordinator\r\nPOSITION DURATION:   Renewable annual contract\r\nPOSITION LOCATION: Yerevan, Armenia\r\nJOB DESCRIPTION:   Public outreach and strengthening of a growing\r\nnetwork of environmental NGOs, businesses, international organizations\r\nand public agencies. Will serve as primary contact between CENN and\r\npublic. This is a full-time position.\r\nJOB RESPONSIBILITIES:  \r\n- Working with the Country Director to provide environmental information\r\nto the general public via regular electronic communications and serving\r\nas the primary local contact to Armenian NGOs and businesses and the\r\nArmenian offices of international organizations and agencies;\r\n- Helping to organize and prepare CENN seminars\/ workshops;\r\n- Participating in defining the strategy and policy of CENN in Armenia,\r\nthe Caucasus region and abroad.\r\nREQUIRED QUALIFICATIONS:  \r\n- Degree in environmentally related field, or 5 years relevant\r\nexperience;\r\n- Oral and written fluency in Armenian, Russian and English;\r\n- Knowledge\/ experience of working with environmental issues specific to\r\nArmenia is a plus.\r\nREMUNERATION:  Salary commensurate with experience. \r\nAPPLICATION PROCEDURES:   Please send resume or CV toursula.kazarian@.... Electronic submissions only, please.\r\nPlease clearly mention in your application letter that you learned of\r\nthis job opportunity through Career Center and mention the URL of its\r\nwebsite - www.careercenter.am, Thanks.\r\nAPPLICATION DEADLINE:   20 January 2004\r\nSTART DATE:  February 2004\r\nABOUT COMPANY:  The Caucasus Environmental NGO Network is a\r\nnon-governmental, non-profit organization established in 1998. Since\r\nestablishment, CENN through its various projects has acted as a\r\nvoluntary effort to foster regional cooperation by means of improved\r\ncommunication among environmental organizations of Armenia, Azerbaijan\r\nand Georgia (and partly Russia and Turkey). CENN is an open,\r\nhorizontally integrated structure aimed at supporting positive,\r\nproductive communication and cooperation on environmental protection\r\nprojects and issues. \r\n----------------------------------\r\nTo place a free posting for job or other career related opportunities in\r\nyour organization at careercenter.am website, e-mail us atmailbox@...","Title":"Country Coordinator","status":"published","Year":2004}
{"jobpost":"Manoff Group\r\nJOB TITLE:  BCC Specialist\r\nPOSITION LOCATION: Manila, Philippines\r\nJOB DESCRIPTION:  The LEAD (Local Enhancement and Development for\r\nHealth) BCC Specialist will apply state-of-the-art approaches in working\r\nwith LGUs (Local Government Units) and NGOs to help them to identify and\r\naddress provider-caused barriers to service provision as well as to\r\nidentify and address supports for good service delivery by developing\r\ntools that may be adapted to each LGU's needs. S\/he will work with LEAD\r\nstaff across all components to support quality service delivery and will\r\nalso monitor implementation of improved service delivery in LGUs, and\r\nwill provide additional assistance to LGUs and NGOs, as needed. S\/he\r\nwill collect all relevant published and grey literature documents,\r\nidentify gaps in knowledge, and work with NGOs and consultants to fill\r\nin the gaps. S\/he will establish training for NGOs and LGU\r\nadministration staff pursuing service enhancement and provider behavior\r\nchange and will oversee the training. S\/he will serve as the Project's\r\nprimary liaison to TSAP and other projects and organizations working in\r\nbehavior change.\r\nJOB RESPONSIBILITIES:  \r\n- Identify gaps in knowledge and overseeing information collection to\r\nfill them;\r\n- Consolidate partnerships with center of excellence of technical\r\nsupport, working with local NGOs\/COs, LCEs, and LGUs;\r\n- Work with LEAD team to develop assessment tools for LGUs to identify\r\nbarriers and supports to quality service provision;\r\n- Assist LGUs and NGOs to design and implement multifaceted (if\r\nnecessary), systematic interventions, based on assessment results, to\r\nenhance quality service provision, especially through provider behavior\r\nchange. For example, ensure that not only providers, but their\r\nsupervisors are trained and that monitoring and supervisory systems\r\npromote provider change, quality services, and sustainability of change;\r\n- Assist other LEAD specialists and units to enhance the quality of\r\nservices, especially through BCC and provider behavior change, and\r\nassure that programs serve community needs;\r\n- Oversee and, when practical, co-facilitate behavior change training\r\nactivities and proposal development and coordinate these activities, as\r\nneeded, with other project components and counterpart agencies;\r\n- Participate in developing programs to address common barriers (e.g.,\r\nstrengthen service providers' interpersonal communication skills through\r\non-the-job training and use of innovative training approaches based on\r\nTSAP-FP and other projects' approaches);\r\n- Provide training to local groups in developing programs in community\r\nmobilization and advocacy to participate in health planning process; \r\n- Develop monitoring and evaluation systems for client-centered quality\r\ncare\/ provider behavior change;\r\n- Reinforce inter-organization collaboration and coordination of BCC\r\ninterventions to improve the overall quality of interventions;\r\n- Serve as primary LEAD liaison with BCC agencies, projects, and\r\nconsultants.\r\nREQUIRED QUALIFICATIONS:  \r\n- Advanced degree in public health, social science, or communication or\r\nrelated experience;\r\n- Familiarity with Behavior-centered Programming SM preferred;\r\n- At least five years experience in the design, implementation, and\r\nmonitoring\/evaluation of behavior change programs in the developing\r\nworld, preferably including Philippines;\r\n- Experience with behavior change in reproductive health and\/or family\r\nplanning programs;\r\n- Excellent communication, coordination, and facilitation skills;\r\n- Experience with PC-based software, including word processing and basic\r\nspreadsheet analysis;\r\n- Knowledge of a language of the Philippines, or willingness to learn;\r\n- High level of written and spoken English fluency.\r\nAPPLICATION PROCEDURES:  Please send cover letter and resume to Amy\r\nPearson at: apearson@.... \r\nPlease clearly mention in your application letter that you learned of\r\nthis job opportunity through Career Center and mention the URL of its\r\nwebsite - www.careercenter.am, Thanks.\r\nAPPLICATION DEADLINE:   23 January 2004\r\nSTART DATE:  Immediate\r\n----------------------------------\r\nTo place a free posting for job or other career related opportunities in\r\nyour organization at careercenter.am website, e-mail us atmailbox@...","Title":"BCC Specialist","status":"published","Year":2004}
{"jobpost":"Yerevan Brandy Company\r\nJOB TITLE:  Software Developer\r\nPOSITION LOCATION: Yerevan, Armenia\r\nJOB RESPONSIBILITIES:  \r\n- Rendering technical assistance to Database Management Systems;\r\n- Realization of SQL servers maintenance activities: back-up and\r\nreplication;\r\n- Participation in designing of software development projects.\r\nREQUIRED QUALIFICATIONS:  \r\n- University degree; economical background is a plus;\r\n- Excellent knowledge of Windows 2000 Server, Networking TCP\/ IP\r\ntechnologies, MS SQL 2000 Server, Visual Basic 6;\r\n- At least 2 years of experience in database software development;\r\n- Good knowledge of English.\r\nREMUNERATION:  Will be commensurate with the norms accepted in the\r\nCompany.\r\nAPPLICATION PROCEDURES:  Successful candidates should submit\r\n- CV; \r\n- 2 relevant Recommendation Letters (from previous employers);\r\n- Copy (-ies) of Diploma (-s) and relevant certificates (if available);\r\n- 1 color photo (3x4)\r\neither to: 2 Isakov Avenue, 375082, Yerevan or send by the following\r\nfax: 587 713 or e-mail to:armine.bibilyan@..., Human Resources Department,\r\nArmine Bibilyan.\r\nPlease clearly mention in your application letter that you learned of\r\nthis job opportunity through Career Center and mention the URL of its\r\nwebsite - www.careercenter.am, Thanks.\r\nAPPLICATION DEADLINE:  20 January 2004, 18:00\r\n----------------------------------\r\nTo place a free posting for job or other career related opportunities in\r\nyour organization at careercenter.am website, e-mail us atmailbox@...","Title":"Software Developer","status":"published","Year":2004}
{"jobpost":"Boutique \"Appollo\"\r\nJOB TITLE:  Saleswoman\r\nPOSITION LOCATION: Yerevan, Armenia\r\nWORK HOURS: 10:00 - 20:00; one free day per week.\r\nJOB DESCRIPTION:   Saleswoman will sell menswear and accessories.\r\nREQUIRED QUALIFICATIONS:  \r\n- Candidates should be female, 20-30 years old;\r\n- Nice-looking exterior; \r\n- Excellent communication skills;\r\n- Fluency in Armenian and Russian;  \r\n- Good knowledge of English (oral).\r\nREMUNERATION:  Starting salary - 40,000 AMD.\r\nAPPLICATION PROCEDURES:  For further information, please contact Irina\r\nNalbandyan at: 538118.\r\nPlease clearly mention in your application letter that you learned of\r\nthis job opportunity through Career Center and mention the URL of its\r\nwebsite - www.careercenter.am, Thanks.\r\nAPPLICATION DEADLINE:   01 February 2004\r\n----------------------------------\r\nTo place a free posting for job or other career related opportunities in\r\nyour organization at careercenter.am website, e-mail us atmailbox@...","Title":"Saleswoman","status":"published","Year":2004}
{"jobpost":"OSI Assistance Foundation - Armenian Branch Office\r\nJOB TITLE:  Chief Accountant\/ Finance Assistant\r\nPOSITION LOCATION: Yerevan, Armenia\r\nJOB DESCRIPTION:   The Armenian Branch Office of the Open Society\r\nInstitute Assistance Foundation is seeking applications for the position\r\nof Chief Accountant\/ Finance Assistant. The Chief Accountant\/ Finance\r\nAssistant will be responsible for all transactions, connected with grant\r\npayments, administrative expenses. \r\nREQUIRED QUALIFICATIONS: \r\n- University degree in finance\/ accounting; \r\n- One year minimum experience in an international organization; \r\n- Strong organizational skills; \r\n- Good knowledge of software programs: MS Excel and MS Access; \r\n- Good knowledge of IAS, Armenian taxation laws, reporting requirements\r\nand current reforms; \r\n- Discretion and ability to handle confidential issues; \r\n- Self-motivation with an ability to set and meet goals; \r\n- Quick learning skills; \r\n- Fluency in English, Armenian and Russian. \r\nAPPLICATION PROCEDURES:  For submission of applications\/ CVs, please\r\ncontact the OSI AF - Armenia at: 1 Pushkin Str., apt. 2. Tel: 54 2119,\r\n54 39 01, 54 17 19; e-mail: jobs@.... \r\nPlease clearly mention in your application letter that you learned of\r\nthis job opportunity through Career Center and mention the URL of its\r\nwebsite - www.careercenter.am, Thanks.\r\nAPPLICATION DEADLINE:   16 January 2004, 6:00 pm.\r\n----------------------------------\r\nTo place a free posting for job or other career related opportunities in\r\nyour organization at careercenter.am website, e-mail us atmailbox@...","Title":"Chief Accountant\/ Finance Assistant","status":"published","Year":2004}
{"jobpost":"International Research & Exchanges Board (IREX)\r\nTITLE:   Non-paid part or full time Programmatic Intern\r\nDURATION:  6 months\r\nLOCATION:  IREX Armenia Main Office\r\nDESCRIPTION:   IREX currently seeks to fill the position of non-paid\r\nfull and part time Programmatic Intern. The position is based in the\r\nYerevan office. This position reports directly to the Administrative\r\nCoordinator or Program Manager.\r\nThe internship program serves to:\r\n- Reinforce and strengthen the interns' personal values and career\r\nobjectives through an improved understanding of themselves and the work\r\nenvironment;\r\n- Assist students in identifying and acquiring the skills needed to\r\nenter a chosen field;\r\n- Provide practical work experience to balance the students' theoretical\r\ntraining;\r\n- Allow students to meet and learn from professionals in the field and\r\ndevelop a network of contacts.\r\nInternship Areas:\r\nAdministrative Internship\r\nThe IREX Administrative Internship provides interns with experience in\r\nthe areas of public relations, secretarial support, translation and\r\ninterpretation.  Interns will be responsible for greeting visitors,\r\nresponding to walk in and telephone inquiries about IREX and its\r\nprograms, directing office communications to appropriate staff, editing\r\nof written text, assisting with daily administrative tasks such as\r\nwritten translation, oral interpretation, filing, copying, faxing,\r\ndrafting correspondence, research, and other duties as needed.\r\nProgram Internships\r\nThe IREX Program Internship provides interns with experience working\r\ndirectly with one or more of IREX's programs including public relations\r\nand outreach, event coordination, and administrative tasks related to\r\nspecific programs.  Interns will be responsible for responding to walk\r\nin and telephone inquiries related to the program, assisting program\r\nstaff with public outreach campaigns, assisting in the development and\r\nediting of outreach materials, assisting in event coordination and\r\nprogram related research, and various administrative tasks including but\r\nnot limited to written translation, oral interpretation, filing,\r\ncopying, faxing, and drafting correspondence.  IREX Program Interns are\r\nassigned to programs according to program needs, technical resources\r\navailable, and intern skills.  Possible placements include: the\r\nEducational Information Center (EIC) and Computer Based Testing Center,\r\nthe Internet Access Training Program (IATP), the Community Connection\r\nExchange Program, Partnerships and Training Division Education\r\nCurriculum Development Programs, and the Academic and Exchanges and\r\nResearch Division Alumni Program.\r\nAPPLICATION PROCEDURES:   To apply, please download and submit the\r\napplication form. For more information please contact IREX at: (374-1)\r\n57-53-36; 57-18-96; 57-16-31 or e-mail us at: irex@.... \r\nPlease clearly mention in your application letter that you learned of\r\nthis opportunity through Career Center and mention the URL of its\r\nwebsite - www.careercenter.am, Thanks.\r\nAPPLICATION DEADLINE:   16 January 2004\r\nABOUT COMPANY:   The International Research & Exchanges Board (IREX) is\r\na US-Based private, non-profit organization. The IREX Armenia Yerevan\r\noffice was established in 1992 and is a place in Armenia where\r\ninterested individuals can obtain up-to-date information on study,\r\nresearch, and professional internship opportunities in the Unites\r\nStates. \r\nIREX Yerevan collaborates with national government branches, local and\r\ninternational NGOs and institutions of higher education in the promotion\r\nof IREX- administered research and professional programs. The goal of\r\nthese programs is to make American academic and professional experiences\r\navailable to qualified individuals.\r\n----------------------------------\r\nTo place a free posting for job or other career related opportunities in\r\nyour organization at careercenter.am website, e-mail us atmailbox@...","Title":"Non-paid part or full time Programmatic Intern","status":"published","Year":2004}
{"jobpost":"Yerevan Brandy Company \r\nJOB TITLE:  Assistant to Managing Director\r\nPOSITION LOCATION: Yerevan, Armenia\r\nJOB RESPONSIBILITIES:  \r\n- Coordinating the work of subordinate employees;\r\n- Maintaining liaison with the other subdivisions within the Company;\r\n- Managing correspondence flow;\r\n- Realizing written and verbal translations;\r\n- Organizing meetings and conferences; compiling minutes of meetings;\r\n- Drawing reports;\r\n- Operating office equipment.\r\nREQUIRED QUALIFICATIONS:  \r\n- University degree;\r\n- At least 3 years of experience in the relevant field;\r\n- Mastership of the office work and competency of business ethics;\r\n- Excellent working knowledge of written and verbal Armenian, Russian\r\nand English; knowledge of French is a plus;\r\n- Knowledge of MS Office;\r\n- Strong problem-solving and organizational skills; outstanding\r\ninterpersonal skills.  \r\nREMUNERATION:  Will be commensurate with the norms accepted in the\r\nCompany\r\nAPPLICATION PROCEDURES:  Successful candidates should submit\r\n- CV; \r\n- 2 relevant Recommendation Letters (from previous employers);\r\n- Copy (-ies) of Diploma (-s);\r\n- 1 color photo (3x4)\r\neither to: 2 Isakov Avenue, 375082, Yerevan or send by the following\r\nfax: 587 713 or e-mail to:armine.bibilyan@..., Human Resources Department,\r\nArmine Bibilyan.\r\nPlease clearly mention in your application letter that you learned of\r\nthis job opportunity through Career Center and mention the URL of its\r\nwebsite - www.careercenter.am, Thanks.\r\nAPPLICATION DEADLINE:   27 January 2004, 18:00\r\n----------------------------------\r\nTo place a free posting for job or other career related opportunities in\r\nyour organization at careercenter.am website, e-mail us atmailbox@...","Title":"Assistant to Managing Director","status":"published","Year":2004}
{"jobpost":"American Embassy Yerevan\r\nANNOUNCEMENT NUMBER: 04-01\r\nJOB TITLE:     Program Assistant (INL), FSN-8; FP-6*\r\nWORK HOURS: Full-time;40 hours\/week \r\nNOTE:  All applicants who are not the family members of USG employees\r\nofficially assigned to post and under chief of mission authority must be\r\nresiding in country and have the required work and\/or residency permits\r\nto be eligible for consideration.\r\nThe U.S. Embassy in Yerevan, Armenia is seeking an individual for the\r\nposition of Program (INL) Assistant in the Regional Narcotics and Law\r\nEnforcement Affairs Office. \r\nJob Description:   The incumbent assists in coordinating INL-funded law\r\nenforcement and drug control programs in Armenia (including training\r\nprograms supported and implemented by US Agencies) to avoid duplication\r\nof effort with other programs and to ensure that assistance from various\r\nUSG agencies is complementary. Additionally, assists on coordinating US\r\nmission activities in the crime and narcotics area with other donors\r\nlike the United Nations, Non Governmental organizations and other\r\ninternational donors.\r\nA copy of the complete position description listing all duties and\r\nresponsibilities is available in the Human Resources Office. Contact\r\nnumber: (3741) 52-46-61  \r\nREQUIRED QUALIFICATIONS:   NOTE: All applicants are instructed to\r\naddress each selection criterion detailed below with specific and\r\ncomprehensive information supporting each criteria.\r\n- University degree in a relevant field (Law, Law Enforcement, Political\r\nScience, Public Administration) or its equivalent is required;\r\n- Two years of progressively responsible experience in program\r\nadministration and logistical support is required;\r\n- Level IV proficiency in English and Armenian;\r\n- Thorough knowledge of Armenian Criminal Justice System, legislative\r\nprocess, and structure and operations of law enforcement agencies\r\nrequired;\r\n- Sound management, analytical and organizational skills. \r\nSELECTION PROCESS:   When equally qualified, Eligible Family Members and\r\nU.S. Veterans will be given preference. Therefore, it is essential that\r\nall candidates address the required qualifications above in the\r\napplication. \r\nADDITIONAL SELECTION CRITERIA: \r\n1. Management will consider nepotism\/ conflict of interest, budget, and\r\nvisa status in determining successful candidacy.\r\n2. Current employees serving a probationary period are not eligible to\r\napply.\r\n3. Currently employed AEFMs who hold a FMA appointment are ineligible to\r\napply for advertised positions within the first 90 calendar days of\r\ntheir employment.  \r\nREMUNERATION:  *Not-Ordinarily Resident: Grade: FP-06 to be confirmed by\r\nWashington\r\n*Ordinarily Resident: Position Grade: FSN-8 \r\nAPPLICATION PROCEDURES:   Interested candidates for this position should\r\nsubmit the following:\r\nA. Application for Federal Employment (SF 171 or OF 612); or\r\nB. A current resume that provides the same information as an OF 612\r\nC. Candidates who claim U.S. Veteran preference must provide a copy of\r\ntheir for DD214 with their application.\r\nD. Any other documentation (e.g., essays, certificates, awards, copies\r\nof degrees earned) that address the minimum requirements of the position\r\nas listed above. \r\nPlease clearly mention in your application letter that you learned of\r\nthis job opportunity through Career Center and mention the URL of its\r\nwebsite - www.careercenter.am, Thanks.\r\nTo:\r\nHuman Resources Office\r\nAttention: Gohar Sargsyan\r\n18 Baghramian Ave, Yerevan 375019, Armenia \r\nPOINT OF CONTACT: \r\nName: Gohar Sargsyan\r\nTelephone: (374 1) 52-46-61\r\nFAX: (374 1) 52-08-00 \r\nDEFINITIONS: \r\n1. AEFM: A type of EFM that is eligible for direct hire employment on\r\neither a Family Member Appointment (FMA) or Temporary Appointment (TEMP)\r\nprovided s\/he meets all the following criteria:\r\n- US citizen;\r\n- Spouse or dependent who is at least age 18;\r\n- Listed on travel orders of a Foreign or Civil Service or uniformed\r\nservice member permanently assigned to or stationed at a US Foreign\r\nservice post or establishment abroad with a ASG agency that is under COM\r\nauthority;\r\n- Is resident at the sponsoring employee s or uniform service member s\r\npost of assignment abroad, approved safehaven abroad, or alternate\r\nsafehaven abroad; and\r\n- Does not receive a USG annuity or pension based on a career in the US\r\nCivil, Foreign, or uniform services.\r\n2. EFM: Family members at least age 18 listed on travel orders of a\r\nForeign or Civil Service or uniformed service member permanently\r\nassigned to or stationed to a US Foreign service post or establishment\r\nabroad with a USG agency that is under COM authority who do not meet the\r\ndefinition of AEFM above.\r\n3. Member of Household (MOH): Foreign born spouses, dependent children,\r\nunmarried partners of the same and opposite sex, parents, other\r\nrelatives or adult children who fall outside the Department s current\r\nlegal and statutory definition of EFM.\r\n4. Ordinarily Resident (OR): A citizen of the Republic of Armenia or a\r\ncitizen of another country who has shifted the main residency focus to\r\nArmenia and has the required work and\/or residency permit for employment\r\nin country.\r\n5. Not Ordinarily Resident (NOR): Typically NORs are AEFMs and EFMs of\r\nFS, GS, and uniform service members who are on the travel orders and\r\nunder Chief of Mission authority, or other personnel having diplomatic\r\nprivileges and immunities. \r\nAPPLICATION DEADLINE:   26 January 2004  \r\nDrafted:   GSargsyan\r\nCleared:  ESchack\r\nApproved:  LRichter  \r\n----------------------------------\r\nTo place a free posting for job or other career related opportunities in\r\nyour organization at careercenter.am website, e-mail us atmailbox@...","Title":"Program Assistant (INL), FSN-8; FP-6*","status":"published","Year":2004}
